---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.DPartFailures
source: html/60230c02-eb7e-98f0-38c8-8da51b5109a8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures

Failures related to parts.

## Syntax (C#)
```csharp
public static class DPartFailures
```